/*
create table aodb_pax( point_id NUMBER(9), pax_id NUMBER(9), record VARCHAR2(2000) );
create table aodb_bag( pax_id NUMBER(9), num NUMBAR(3), record VARCHAR2(2000) );
INSERT INTO file_types(code,name,in_order) VALUES( "AODB", "AODB", 1 );
INSERT INTO file_param_sets
alter table aodb_bag add pr_cabin NUMBER(1) NOT NULL;
*/
#include "aodb.h"

#include <string>
#include <sstream>
#include <iomanip>
#include <vector>
#include <map>
#include <algorithm>
#include <sstream>

#include "exceptions.h"
#include "basic.h"
#include "stl_utils.h"
#include "base_tables.h"
#include "astra_consts.h"
#include "astra_utils.h"
#include "astra_service.h"
#include "misc.h"
#include "astra_misc.h"
#include "stages.h"
#include "tripinfo.h"
#include "salons2.h"
#include "serverlib/helpcpp.h"

#define NICKNAME "DJEK"
#define NICKTRACE DJEK_TRACE
#include "serverlib/slogger.h"

using namespace std;
using namespace EXCEPTIONS;
using namespace BASIC;
using namespace ASTRA;

struct AODB_STRUCT{
	int pax_id;
	int reg_no;
	int num;
	int pr_cabin;
	bool unaccomp;
	bool doit;
	string record;
};

struct AODB_Dest {
	int num; //1
	std::string airp; //3
	int pr_del; //1
};

struct AODB_Term {
	std::string type; //1
	std::string name; //4
	int pr_del; //1
};

const
  unsigned int REC_NO_IDX = 0;
  unsigned int REC_NO_LEN = 6;
  unsigned int FLT_ID_IDX = 6;
  unsigned int FLT_ID_LEN = 10;
  unsigned int TRIP_IDX = 16;
  unsigned int TRIP_LEN = 10;
  unsigned int LITERA_IDX = 26;
  unsigned int LITERA_LEN = 3;
  unsigned int SCD_IDX = 29;
  unsigned int SCD_LEN = 16;
  unsigned int EST_IDX = 45;
  unsigned int EST_LEN = 16;
  unsigned int ACT_IDX = 61;
  unsigned int ACT_LEN = 16;
  unsigned int HALL_IDX = 77;
  unsigned int HALL_LEN = 2;
  unsigned int PARK_OUT_IDX = 79;
  unsigned int PARK_OUT_LEN = 5;
  unsigned int KRM_IDX = 84;
  unsigned int KRM_LEN = 3;
  unsigned int MAX_LOAD_IDX = 87;
  unsigned int MAX_LOAD_LEN = 6;
  unsigned int CRAFT_IDX = 93;
  unsigned int CRAFT_LEN = 10;
  unsigned int BORT_IDX = 103;
  unsigned int BORT_LEN = 10;
  unsigned int CHECKIN_BEG_IDX = 113;
  unsigned int CHECKIN_BEG_LEN = 16;
  unsigned int CHECKIN_END_IDX = 129;
  unsigned int CHECKIN_END_LEN = 16;
  unsigned int BOARDING_BEG_IDX = 145;
  unsigned int BOARDING_BEG_LEN = 16;
  unsigned int BOARDING_END_IDX = 161;
  unsigned int BOARDING_END_LEN = 16;
  unsigned int PR_CANCEL_IDX = 177;
  unsigned int PR_CANCEL_LEN = 1;
  unsigned int PR_DEL_IDX = 178;
  unsigned int PR_DEL_LEN = 1;

struct AODB_Flight {
	int rec_no; //6
	double id;	//10
	std::string airline; //10
	int flt_no;
	std::string suffix;
	std::string litera; //3
	std::string trip_type;
	TDateTime scd; //16
	TDateTime est; //16
	TDateTime act; //16
	std::string hall; //2
	std::string park_out;
	int krm; //3
	int max_load; //6
	std::string craft; //10
	std::string bort; //10
	TDateTime checkin_beg; //16
	TDateTime checkin_end; //16
	TDateTime boarding_beg; //16
	TDateTime boarding_end; //16
	int pr_cancel; //1
	int pr_del; //1
	vector<AODB_Dest> dests;
	vector<AODB_Term> terms;
	string invalid_term;
};

void getRecord( int pax_id, int reg_no, bool pr_unaccomp, const vector<AODB_STRUCT> &aodb_pax,
                const vector<AODB_STRUCT> &aodb_bag,
                string &res_checkin );
void createRecord( int point_id, int pax_id, int reg_no, const string &point_addr, bool pr_unaccomp,
                   const string unaccomp_header,
                   vector<AODB_STRUCT> &aodb_pax, vector<AODB_STRUCT> &aodb_bag,
                   vector<AODB_STRUCT> &prior_aodb_pax, vector<AODB_STRUCT> &prior_aodb_bag,
                   string &res_checkin );

void createFileParamsAODB( int point_id, map<string,string> &params, bool pr_bag )
{
	TQuery FlightQry( &OraSession );
	FlightQry.SQLText = "SELECT airline,flt_no,suffix,scd_out FROM points WHERE point_id=:point_id";
	FlightQry.CreateVariable( "point_id", otInteger, point_id );
	FlightQry.Execute();
